assignments/A00a.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-01-08 Tue 10:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Assignment 00a</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="lx" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Assignment 00a
<br />
<span class="subtitle">Linux CLI</span>
</h1>

<div id="outline-container-orgd07063d" class="outline-2">
<h2 id="orgd07063d">Linux CLI</h2>
<div class="outline-text-2" id="text-orgd07063d">
<p>
Due: 2019/01/14 at 09:00 AM.
</p>

<p>
Get to know the Linux Command Line Interface (CLI).
This assignment can be done on the lab computers in Luddy 4111.
</p>

<p>
For extra style points (no extra credit though, sorry) you can optionally complete this assignment without ever physically visiting Luddy 4111.  Hint: use <code>ssh</code>.
</p>
</div>
</div>

<div id="outline-container-orgd28c1ff" class="outline-2">
<h2 id="orgd28c1ff">Background</h2>
<div class="outline-text-2" id="text-orgd28c1ff">
<p>
Below is a crash course on using the Linux CLI.  Refer to <a href="https://beebom.com/essential-linux-commands/">https://beebom.com/essential-linux-commands/</a> for info on some of the commands used.
</p>

<dl class="org-dl">
<dt>Important</dt><dd>No one is born knowing all of Linux (or any operating system for that matter).  It is fine to start small and grow your knowledge gradually, as needed.  You can accomplish a whole lot with just 5 commands: <code>ls</code>, <code>cd</code>, <code>cat</code>, <code>mkdir</code>, and <code>rm</code>.  These 5 easily account for 80% of my CLI usage.</dd>
</dl>
</div>

<div id="outline-container-org5f41cd4" class="outline-3">
<h3 id="org5f41cd4">Terminal and Shell</h3>
<div class="outline-text-3" id="text-org5f41cd4">
<p>
The usual way to access the Linux CLI is through a program called a <i>terminal emulator</i>, or just <i>terminal</i>.  To get a terminal, you can browse through the programs to find one called <code>xterm</code> and click on it, or a slightly faster way is to type the Windows key on the keyboard, then start typing "t" "e" "r" "m" to search for programs on the machine.  When you see <code>xterm</code> you can select it with the arrow keys and hit Enter to run it.
</p>

<p>
The main point of the terminal is to display a grid of text characters, and to accept input from the keyboard.  The program that does most of the work of deciding <i>what characters</i> get displayed is called the <i>Shell</i>.  Think of it as a "shell" of interactive functionality around the "core" or <i>Kernel</i> of the operating system.  Most modern operating systems have a kernel with one or more "shells".  The shells can be text-based (as in this case) or graphical (think MacOS or Windows).  The default shell used by the terminal in SICE computers and many other Linux-based operating systems is called <code>bash</code>.
</p>

<dl class="org-dl">
<dt>xterm</dt><dd>a terminal emulator that provides a place for keyboard input and text output</dd>
<dt>bash</dt><dd>the default shell program</dd>
</dl>

<p>
There are other terminal programs, and other shell programs.  The differences are typically minor.  Stick with the defaults if you're starting out.
</p>
</div>
</div>

<div id="outline-container-org4ae5825" class="outline-3">
<h3 id="org4ae5825">Running Commands</h3>
<div class="outline-text-3" id="text-org4ae5825">
<p>
After launching the terminal, you should see a small amount of text and a (possibly blinking) cursor.  You can type or paste in text-only commands, and typing the Enter key (or providing a newline character in your pasted text) will execute everything typed before the newline/Enter.
</p>

<p>
Examples:
</p>

<div class="org-src-container">
<pre class="src src-shell">ashroyer@~ ls
ashroyer@~ ls -la
ashroyer@~ ls -la /tmp
ashroyer@~ pwd
ashroyer@~ man -k python
ashroyer@~ man -k python  <span style="color: #008b45;"># </span><span style="color: #008b45;">comments start with "#" and go to the end of the line</span>
</pre>
</div>

<p>
Notice the syntax: each line begins with a <i>prompt</i> which is read-only (<code>ashroyer@~</code>), followed by a command.  Spaces separate different parts of commands.  Some only need the name of the command, such as <code>ls</code>.  Others add <i>flags</i> or <i>options</i> to modify the command, such as <code>ls -la</code>.  Still others take <i>arguments</i> as in <code>ls -la /tmp</code> (the <b>argument</b> here is <code>/tmp</code>).
</p>
</div>
</div>

<div id="outline-container-org590158e" class="outline-3">
<h3 id="org590158e">If you are unsure</h3>
<div class="outline-text-3" id="text-org590158e">
<p>
<code>man</code> pages can take some getting used to.  For quick examples, check out the tldr pages.  They don't replace the <code>man</code> pages, but are a good supplement: <a href="https://tldr.ostera.io/">https://tldr.ostera.io/</a>
</p>

<p>
In addition, there is built-in help and user manuals in Linux, but because it's text-only you have to know how to find it.
</p>

<dl class="org-dl">
<dt>man</dt><dd>the "manual" pages.  <code>man ls</code> sends you to the manual for <code>ls</code>.  <code>man -k python</code> shows a list of manual pages related to python.  Pick one and use it as your next argument to <code>man</code>.</dd>
<dt>help</dt><dd>for functionality built-in to the <code>shell</code>.  Often overlaps with <code>man</code>.</dd>
</dl>

<p>
Running <code>man python</code> launches a special program called a <i>pager</i> which is a read-only view of a file.  The default pager program is usually one called <code>less</code>.  You can scroll down and up inside of <code>less</code> using the <code>j</code> and <code>k</code> keys, respectively.  You can quit the pager program to go back to the shell by typing <code>q</code>, and you can search within the document by typing <code>/</code> followed by the word you want to find, then typing Enter.
</p>
</div>
</div>

<div id="outline-container-org1af1ed1" class="outline-3">
<h3 id="org1af1ed1">Echo</h3>
<div class="outline-text-3" id="text-org1af1ed1">
<p>
The <code>echo</code> command takes whatever you type after the first space and repeats it back to you.
</p>

<div class="org-src-container">
<pre class="src src-shell">ashroyer@~ echo stop copying me
stop copying me
</pre>
</div>

<p>
This will actually come in handy later.
</p>
</div>
</div>

<div id="outline-container-orgafc260c" class="outline-3">
<h3 id="orgafc260c">Redirection</h3>
<div class="outline-text-3" id="text-orgafc260c">
<p>
Printing output to the terminal screen is useful, but sometimes we want to save the output of a command to a file.  The <code>bash</code> shell provides a single character command for this: <code>&gt;</code>, example:
</p>

<div class="org-src-container">
<pre class="src src-shell">ashroyer@~ ls &gt; myfile.txt
</pre>
</div>

<p>
This saves the output of <code>ls</code> to a file called <code>myfile.txt</code>.  If there was already a file with the same name, it is now overwritten.  There is no "are you sure?" prompt, so be sure when you type.  To <i>append</i> to a file you can use <code>&gt;&gt;</code> instead:
</p>

<div class="org-src-container">
<pre class="src src-shell">ashroyer@~ ls &gt;&gt; myfile.txt
</pre>
</div>
</div>
</div>

<div id="outline-container-org82c89d4" class="outline-3">
<h3 id="org82c89d4">Pipes</h3>
<div class="outline-text-3" id="text-org82c89d4">
<p>
The output text of one command can be used as input for another command.  For example, you can run <code>ls</code> to see a list of folders and files, but if you want to know how many items total, you can send the output of <code>ls</code> into the program <code>wc</code> (word count).  For example:
</p>

<div class="org-src-container">
<pre class="src src-shell">ashroyer@~ ls | wc  <span style="color: #008b45;"># </span><span style="color: #008b45;">newline count, word count, character count</span>
     <span style="color: #259ea2;">26</span>      <span style="color: #259ea2;">26</span>     <span style="color: #259ea2;">276</span>
ashroyer@~ ls | wc -l  <span style="color: #008b45;"># </span><span style="color: #008b45;">lines only</span>
<span style="color: #259ea2;">26</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org705e0ad" class="outline-3">
<h3 id="org705e0ad">Where does one command end and another begin?</h3>
<div class="outline-text-3" id="text-org705e0ad">
<p>
This can be confusing when you're new to the CLI.  For the most part, "words" including commands, options, and arguments, are separated from each other by spaces.  But what if you want an argument that contains spaces?  This can often be solved by wrapping the multi-word phrase in double quotes:
</p>

<div class="org-src-container">
<pre class="src src-shell">ashroyer@~ ls -lA | wc         <span style="color: #008b45;"># </span><span style="color: #008b45;">a command (ls -lA) piped into another command (wc)</span>
     <span style="color: #259ea2;">67</span>     <span style="color: #259ea2;">596</span>    <span style="color: #259ea2;">4031</span>
ashroyer@~ echo ls -lA | wc    <span style="color: #008b45;"># </span><span style="color: #008b45;">Oops! This counted the output of echo ls -lA ("ls -lA" ) which was only 7 characters</span>
      <span style="color: #259ea2;">1</span>       <span style="color: #259ea2;">2</span>       <span style="color: #259ea2;">7</span>
ashroyer@~ echo <span style="color: #fa5151;">"ls -lA | wc"</span>  <span style="color: #008b45;"># </span><span style="color: #008b45;">What I wanted instead was to echo the text of the command, rather than its output</span>
ls -lA | wc
</pre>
</div>
</div>
</div>

<div id="outline-container-orga319eb3" class="outline-3">
<h3 id="orga319eb3">PATHs through the file system</h3>
<div class="outline-text-3" id="text-orga319eb3">
<p>
Most operating systems have the concept of <i>directories</i> (or <i>folders</i>) and <i>files</i>.  Files are the data, and folders are places to put data or other folders.  Linux is no different, but in a text-only environment we have text-based ways to find files and run commands in different folders.
</p>

<p>
A command called <code>pwd</code>, short for "print working directory" lists the full path from the root of the filesystem to your shell's current execution context.
</p>

<p>
Example (with output):
</p>

<div class="org-src-container">
<pre class="src src-shell">ashroyer@~ pwd
/u/ashroyer
</pre>
</div>

<p>
The first line contains the prompt and the command; the second line contains the output of <code>pwd</code>.  Here, the working directory is <code>/u/ashroyer</code>.  The first slash character (<code>/</code>) indicates the root of the filesystem.  The next part (<code>u</code>) is a folder called <code>u</code>.  Next comes another slash, which serves to visually separate folders, and finally <code>ashroyer</code> which is another folder name.
</p>

<p>
This becomes clear if you <i>change directory</i> and use <code>pwd</code> again.  The command <code>cd</code> changes directories.  It takes as argument the path to the directory you want to go to.
</p>

<div class="org-src-container">
<pre class="src src-shell">ashroyer@~ cd /tmp
ashroyer@~ pwd
/tmp
ashroyer@~ cd
ashroyer@~ pwd
/u/ashroyer
</pre>
</div>


<p>
Above, I first changed my current directory to <code>/tmp</code>, then I ran <code>cd</code> again (this time with no argument) and it sent me to <code>/u/ashroyer</code> again, because that's the <b>home directory</b> for my account.  The <b>home directory</b> is often abbreviated with a tilde: <code>~</code>, as in <code>cd ~/myfolder</code> (which is short for <code>cd /u/ashroyer/myfolder</code>).   Another nice feature of <code>cd</code> is when you want to change back to the previous directory, you can use <code>cd -</code>.  This can save a lot of typing:
</p>

<div class="org-src-container">
<pre class="src src-shell">ashroyer@~ cd /some/very/long/directory/path
ashroyer@~ cd /some/other/very/long/path
ashroyer@~ cd -
ashroyer@~ pwd
/some/very/long/directory/path
</pre>
</div>

<p>
You can <code>cd ..</code> to move <i>up</i> one directory, or <code>cd ../../</code> to move up two levels, etc:
</p>

<div class="org-src-container">
<pre class="src src-shell">ashroyer@~ mkdir -p some/very/long/directory/path  <span style="color: #008b45;"># </span><span style="color: #008b45;">mkdir means "make directory", the -p flag means "even if it doesn't already exist"</span>
ashroyer@~ cd some/very/long/directory/path
ashroyer@~ pwd
/u/ashroyer/some/very/long/directory/path
ashroyer@~ cd ../
ashroyer@~ pwd
/u/ashroyer/some/very/long/directory
ashroyer@~ cd ../../../
ashroyer@~ pwd
/u/ashroyer/some
</pre>
</div>

<p>
Finally, you can <code>cd</code> up and down a different path in a single command:
</p>

<div class="org-src-container">
<pre class="src src-shell">ashroyer@~ cd some/very/long/directory/path
ashroyer@~ cd ../../../other/long/path
ashroyer@~ pwd
/u/ashroyer/some/other/long/path
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org09d347b" class="outline-2">
<h2 id="org09d347b">Assignment</h2>
<div class="outline-text-2" id="text-org09d347b">
<p>
Using some of the <a href="https://beebom.com/essential-linux-commands/">Linux commands listed here</a>, plus output redirection (<code>&gt;</code> and <code>&gt;&gt;</code>), create a text file called <code>A00a.txt</code>.  You can edit this file using a <i>text editor</i> on the SICE machines (text editors include <code>vim</code>, <code>nano</code>, <code>emacs</code>, and <code>gedit</code>.  Use <code>gedit</code> if you don't prefer one of the others in that list.  However, do not use copy-paste from the terminal.
</p>

<p>
Begin by following these steps (run these <b>exact</b> commands in the terminal):
</p>

<div class="org-src-container">
<pre class="src src-shell">yourusername@~ mkdir -p ~/a/b/c              <span style="color: #008b45;"># </span><span style="color: #008b45;">make a nested group of folders</span>
yourusername@~ mkdir -p ~/a/x/y              <span style="color: #008b45;"># </span><span style="color: #008b45;">both b and x are directly "under" folder a</span>
yourusername@~ find ~/a &gt;&gt; ~/a/x/y/A00a.txt  <span style="color: #008b45;"># </span><span style="color: #008b45;">create the file</span>
yourusername@~ cd ~/a/x/y                    <span style="color: #008b45;"># </span><span style="color: #008b45;">change directory so we can use shorter path names</span>
yourusername@~ pwd &gt;&gt; A00a.txt               <span style="color: #008b45;"># </span><span style="color: #008b45;">add the current working directory to the file</span>
</pre>
</div>

<p>
Your prompt will look different from this (no one is actually named <code>yourusername</code>) but everyone's <code>A00a.txt</code> will look the same for the first few lines.
</p>

<p>
To finish, append the output of 5 more commands to <code>A00a.txt</code>.  These <b>must</b> be commands which produce output, because otherwise it will be very boring.
</p>

<p>
However, before appending the output, list the commands you will be using.  For example, if I decided to forfeit some points and use only 2 commands (<code>ls</code> and <code>wc</code>), then my next steps would be:
</p>


<div class="org-src-container">
<pre class="src src-shell">yourusername@~ echo ls wc &gt;&gt; A00a.txt <span style="color: #008b45;"># </span><span style="color: #008b45;">tell the graders what commands you will use</span>
yourusername@~ ls &gt;&gt; A00a.txt         <span style="color: #008b45;"># </span><span style="color: #008b45;">append the output of the first command to the file</span>
yourusername@~ wc &gt;&gt; A00a.txt         <span style="color: #008b45;"># </span><span style="color: #008b45;">append the output of the second command to the file</span>
</pre>
</div>

<p>
Submit your <code>A00a.txt</code> to the Autograder before the due date for credit.
</p>
</div>
</div>
</div>
</body>
</html>
